; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared2 - mode
	thermograph1 - mode
	thermograph0 - mode
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star0 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 infrared2)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(pointing satellite1 Phenomenon8)
	(have_image Phenomenon7 thermograph1)
	(have_image Phenomenon8 thermograph0)
	(have_image Planet9 infrared2)
	(have_image Phenomenon10 infrared2)
	(have_image Star11 thermograph0)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 6
3. (turn_to satellite1 planet9 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet9)
   goals met: 0 of 6
4. (take_image satellite1 planet9 instrument2 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 1 of 6
5. (turn_to satellite1 phenomenon7 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 6
6. (take_image satellite1 phenomenon7 instrument2 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 2 of 6
7. (turn_to satellite1 phenomenon10 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 6
8. (take_image satellite1 phenomenon10 instrument2 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 3 of 6
9. (turn_to satellite1 star11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star11)
   goals met: 3 of 6
10. (take_image satellite1 star11 instrument2 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 4 of 6
11. (turn_to satellite1 phenomenon8 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon8)
   goals met: 5 of 6
12. (take_image satellite1 phenomenon8 instrument2 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 6 of 6
